Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, None, None, 3)]   0         
_________________________________________________________________
conv1 (Conv2D)               (None, None, None, 64)    4864      
_________________________________________________________________
batch_normalization (BatchNo (None, None, None, 64)    256       
_________________________________________________________________
activation (Activation)      (None, None, None, 64)    0         
_________________________________________________________________
conv2 (Conv2D)               (None, None, None, 64)    102464    
_________________________________________________________________
batch_normalization_1 (Batch (None, None, None, 64)    256       
_________________________________________________________________
activation_1 (Activation)    (None, None, None, 64)    0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, None, None, 64)    0         
_________________________________________________________________
dropout (Dropout)            (None, None, None, 64)    0         
_________________________________________________________________
conv3 (Conv2D)               (None, None, None, 128)   204928    
_________________________________________________________________
batch_normalization_2 (Batch (None, None, None, 128)   512       
_________________________________________________________________
activation_2 (Activation)    (None, None, None, 128)   0         
_________________________________________________________________
conv4 (Conv2D)               (None, None, None, 192)   614592    
_________________________________________________________________
batch_normalization_3 (Batch (None, None, None, 192)   768       
_________________________________________________________________
activation_3 (Activation)    (None, None, None, 192)   0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, None, None, 192)   0         
_________________________________________________________________
dropout_1 (Dropout)          (None, None, None, 192)   0         
_________________________________________________________________
conv5 (Conv2D)               (None, None, None, 256)   1229056   
_________________________________________________________________
batch_normalization_4 (Batch (None, None, None, 256)   1024      
_________________________________________________________________
activation_4 (Activation)    (None, None, None, 256)   0         
_________________________________________________________________
dropout_2 (Dropout)          (None, None, None, 256)   0         
_________________________________________________________________
global_average_pooling2d (Gl (None, 256)               0         
_________________________________________________________________
dense (Dense)                (None, 7)                 1799      
=================================================================
Total params: 2,160,519
Trainable params: 2,159,111
Non-trainable params: 1,408
_________________________________________________________________
